// src/data/categories.js

export const categories = [
  {
    name: '위업',
    icon: '',
    subcategories: ['위업']
  },
  {
    name: '모험',
    icon: '',
    subcategories: ['일반', '에포나 의뢰', '기억의 오르골', '대륙:아르테미스', '대륙:유디아',
  '대륙:루테란 서부', '대륙:루테란 동부', '대륙:토토이크', '대륙:애니츠', '대륙:아르데타인',
  '대륙:베른북부', '대륙:슈샤이어', '대륙:로헨델', '대륙:욘', '대륙:페이튼',
  '대륙:파푸니카', '대륙:베른 남부', '대륙:로웬', '대륙:엘가시아', '대륙:플레체',
  '대륙:볼다이크', '대륙:쿠르잔 남부', '대륙:쿠르잔 북부', '대륙:림레이크 남섬',
  '섬:기에나의 바다', '섬:프로키온의 바다']
  },
  {
    name: '캐릭터',
    icon: '',
    subcategories: ['일반', '클래스:전사', '클래스:마법사', '클래스:무도가', '클래스:암살자',
  '클래스:헌터', '클래스:스페셜리스트', '아이템', '수집', '카드', '교류', '거래']
  },
  {
    name: '생활',
    icon: '',
    subcategories: ['일반', '벌목', '식물채집', '채광', '수렵', '낚시', '고고학']
  },
  {
    name: '전투',
    icon: '',
    subcategories: ['일반', '대결', '타워', '큐브', '가디언 토벌',
  '증명의 전장', '카오스 던전', '카오스게이트', '카제로스 전광판']
  },
  {
    name: '공격대',
    icon: '',
    subcategories: ['어비스 레이드', '어비스 던전', '군단장 레이드', '카제로스 레이드', '에픽 레이드']
  },
  {
    name: '항해',
    icon: '',
    subcategories: ['해상활동', '모험물', '선원', '선박']
  },
  {
    name: '원정대 영지',
    icon: '',
    subcategories: ['일반', '활동', '수집', '파견']
  },
  {
    name: '히든',
    icon: '',
    subcategories: ['히든']
  },
  {
    name: '유산',
    icon: '',
    subcategories: ['유산']
  },
];